<template>
  <div :data-aos="!isMobile ? 'fade-down' : ''" class="main__about-text">
    <div class="main__about-text-wrapper">
      <div class="main__about-text-wrapper-inner">
        <p>
          Центр красоты «Estetiс» - ваш надежный эксперт в области косметических
          инъекций, массажа, лазерных процедур и ухода за кожей, волосами и
          ногтями. Наши высококвалифицированные специалисты обеспечивают
          максимальную безопасность и эффективность каждой процедуры.
        </p>
        <p>
          Мы создаем индивидуальные планы для каждого клиента, помогая выбрать
          наиболее подходящие процедуры и оптимальную ценовую категорию.
        </p>
        <p>
          Наша миссия - предоставлять доступные и высокоэффективные процедуры с
          использованием новейшего оборудования и современных методик.
        </p>
        <p>
          Свяжитесь с нами уже сегодня для первой консультации и подбора лучших
          методов ухода именно для вас.
        </p>
        <p>Пусть ваша красота станет реальностью вместе с нами!</p>
      </div>
    </div>
  </div>
</template>

<script setup>
import { useIsMobile } from "@/useIsMobile.js";
const { isMobile } = useIsMobile();
</script>
